app/Controllers/Surat.php

    public function edit($id)
    {
        // Form untuk edit data
        $data['surat'] = $this->suratModel->where('No', $id)->first();
---
SELECT *
FROM `surat`
WHERE `No` = '16'
 LIMIT 1