app/Models/Kejadian_model.php

SELECT *
FROM `kejadian`
---
    public function getKejadian()
    {
        // Fetch all kejadian records from the database
        return $this->findAll();