app/Models/Surat_model.php

    public function get_surat()
    {
        return $this->findAll();
---
SELECT *
FROM `surat`

    public function update_surat($data, $id)
    {
        $this->update($id, $data);
---
UPDATE `surat` SET `Tanggal_Kirim_Surat` = '2024-01-13', `Nomor_Kirim_Surat` = '321313', `Perihal` = 'pajak', `Tujuan_Surat` = 'seluruh asn kecamatan lengkong', `Tanda_Tangan_Penerima` = 'ada', `Keterangan` = 'harap tiba tepat waktu'
WHERE `surat`.`No` IN ('16')